updated readme with new frontend development feature upgrades to access historical recordings; license updated
